{
  "users": [
    {
      "id": 1,
      "username": "blueshoes34",
      "email": "blue@net.com",
      "password": "1234"
    },
    {
      "id": 2,
      "username": "pink23",
      "email": "grace@home.com",
      "password": "1234"
    },
    {
      "id": 3,
      "username": "faith33",
      "email": "faith@home.com",
      "password": "faith!"
    },
    {
      "username": "joy",
      "email": "joy@home.com",
      "password": "1234",
      "id": 4
    },
    {
      "username": "kaylis",
      "email": "kaylis@home.com",
      "password": "1234",
      "id": 5
    }
  ],
  "recipes": [
    {
      "id": 8,
      "name": "blueberry ",
      "recipe": "1 pint Blackberries, raw\n½ cup Sugars, granulated  \n½ teaspoon Lemon peel, raw\n2 cups Cream, fluid, heavy whipping\n½ cup Milk, fluid, 3.25% milk fat  \n1 teaspoon Vanilla extract\nCombine blackberries, sugar, and lemon zest in the bowl of a food processor; process until mixture is pureed. Let sit for 10 minutes.\nStrain the seeds through a fine mesh sieve and return puree to the food processor. Add cream, milk, and vanilla extract. Pulse until mixture is whipped, about 30 seconds.\nPour mixture into an ice cream maker and freeze according to manufacturer's instructions, about 20 minutes. Transfer to an airtight container and freeze until firm, 2 hours to overnight.",
      "url": "https://res.cloudinary.com/dszckhcld/image/upload/v1596032479/icecream/fkxntrpklij5n4amnggs.webp",
      "typeId": 1,
      "userId": 1
    },
    {
      "id": 9,
      "userId": 2,
      "typeId": 1,
      "name": "oreo",
      "recipe": "1 cup whole milk, very cold\n2/3 cup sugar\n2 cups heavy cream, very cold\n2 teaspoon vanilla extract\n1 cup crumbled Oreo cookies\nWhisk together milk and sugar in a bowl until sugar dissolves.\n\nAdd in heavy cream and vanilla.\nTransfer into your ice cream maker and freeze according to manufacturer’s instructions.\nStir in the crumbled Oreo and wait in the freezer in a 9×5 loaf pan for 2-3 hours.",
      "url": "https://res.cloudinary.com/dszckhcld/image/upload/v1595961787/ice%20cream%20pictures/photo-1563805042-7684c019e1cb_wf9i9o.jpg"
    },
    {
      "id": 10,
      "userId": 3,
      "typeId": 1,
      "name": "cookie dough ",
      "recipe": "1 cup flour\n½ cup butter\n½ cup brown sugar\n¼ cup milk\n1 teaspoon vanilla extract\n1 cup mini chocolate chips\n2 cups heavy cream\n14 oz condensed milk, 1 can\nPreheat oven to 350˚F (175˚C).\nEvenly spread the flour out on a sheet pan, and bake for 5 minutes to kill bacteria.\nIn a large bowl, cream the butter and sugar. Add the milk and vanilla, and mix until thoroughly incorporated.\nAdd the baked flour and mix, and gently fold in chocolate chips.\nUsing a small spoon, scoop out dime-sized rounds of the dough and transfer to a sheet pan. Freeze for a minimum of an hour.\nIn a large bowl, add the cream and condensed milk, then whip until soft peaks form.\nFold in the frozen cookie dough, then transfer to a baking pan. Top with additional cookie dough chunks if desired.\nFreeze for 3-4 hours.",
      "url": "https://res.cloudinary.com/dszckhcld/image/upload/v1595962380/ice%20cream%20pictures/photo-1590080962330-747c6aba8028_gl9sy5.jpg"
    },
    {
      "id": 12,
      "userId": 1,
      "name": "Strawberry ",
      "typeId": 2,
      "recipe": "2 cups chopped strawberries \n1 cup sugar (divided)\n2 cups heavy cream \n1 cup whole milk\n 1/2 tsp vanilla extract \n1 dash salt \nMix chopped strawberries with 1/2 cup sugar in a medium sized bowl. Allow to set for about 15 minutes so strawberries release their juices.  Blend strawberries up in a blender or food processor.  In a large bowl combine strawberry mixture with heavy cream, whole milk, vanilla extract, salt and remaining sugar. Set aside. Pour strawberry cream mixture into prepared ice cream maker. Allow to run according to manufactures instructions (Mine is about 30 minutes.)  Serve now for soft serve ice cream.  For scoop able ice cream, scoop ice cream into a bread loaf pan and cover with plastic wrap. Place in the freezer for 6 hours up to overnight. ",
      "url": "https://res.cloudinary.com/dszckhcld/image/upload/v1595987304/icecream/euwjpvlyxzzke9p6gfoe.webp"
    },
    {
      "id": 13,
      "userId": 2,
      "name": "Villa Caramel ",
      "typeId": 3,
      "recipe": " 5 egg yolks\n 1/2 cup packed dark brown sugar, divided\n 1 3/4 cup heavy cream\n 3/4 cup whole milk\n 1/4 teaspoon kosher salt\n 2 teaspoons vanilla bean paste (may use vanilla extract if desired)\nFor the caramel\n1 cup sugar\n 3/4 cup heavy cream, warmed\n 1/8 teaspoon kosher salt\n 1 teaspoon vanilla\nIn a large Pyrex measuring cup or heatproof bowl, whisk the yolks with ¼ cup of the brown sugar. Set aside.\nIn a heavy saucepan, stir together the cream, milk, salt, and the remaining ¼ cup of brown sugar and put the pan over medium-high heat. When the mixture starts to simmer, decrease the heat.\nRemove about ½ cup of the hot cream mixture while constantly whisking the eggs, slowly drizzle the cream into the egg yolks. Repeat with another ½ cup of hot cream, then pour the egg-cream mixture back into the saucepan, whisking as you pour.\nCook the mixture carefully over medium heat, stirring constantly, until it is thickened, about 1-2 more minutes.\nStrain the custard mixture through a fine-mesh strainer into a clean container. Set the container into an ice-water bath (I fill my sink with ice cubes, then adds some water). Stir occasionally, till cool. Remove the container from the ice-water bath, cover with plastic wrap, and refrigerate\nfor at least 2 hours or overnight.\nWhile the ice cream base cools, make the caramel.\nSet the warm cream by the stove so it's at hand when you need it. Put 2 tablespoons of the sugar in a heavy saucepan over medium-high heat. When the sugar is melted around the edges and starts turn golden, stir the mixture gently and add another 2 tablespoons sugar to the pan.\nContinue to add the remaining sugar 2 tablespoons at a time, stirring frequently and allowing most of the sugar to melt before you add more. Watch carefully as the sugar darkens, stirring gently to help it melt evenly.\nWhen the bubbling slows down, gently stir in the cream to blend. If you have any hard sugar lumps, just keep the burner on low and cook till sugar melts. Stir in salt and vanilla and allow to cool to room temperature.",
      "url": "https://res.cloudinary.com/dszckhcld/image/upload/v1596032706/icecream/qijrvruv7es9ujwv5pwu.webp"
    },
    {
      "id": 14,
      "name": "strawberry ",
      "recipe": "In a blender, blend the frozen strawberries, coconut milk, and honey until you have a smooth mixture.  Taste and add more sweetener if you prefer.\nPour the mixture into a freezer-safe container (I used a loaf pan cover with plastic wrap and foil), cover tightly, and freeze until solid, at least 3 hours.  Enjoy!!",
      "url": "https://res.cloudinary.com/dszckhcld/image/upload/v1597178250/icecream/t8l3rmjatjfn7sqmaku5.webp",
      "typeId": 3,
      "userId": 1
    }
  ],
  "types": [
    {
      "id": 1,
      "type": "regular"
    },
    {
      "id": 2,
      "type": "fruit"
    },
    {
      "id": 3,
      "type": "lactose"
    }
  ],
  "comments": [
    {
      "id": 1,
      "userId": 2,
      "postedId": 2,
      "comment": "That blueberry ice cream was great"
    },
    {
      "id": 2,
      "userId": 3,
      "postId": 3,
      "comment": "Have you tried dark choclate ice cream"
    },
    {
      "id": 4,
      "comment": "how was the cookie dough  ice cream ?",
      "userId": 1,
      "postedId": 1
    },
    {
      "id": 5,
      "comment": "The Chocolate ice cream was really good! ",
      "userId": 1,
      "postedId": 1
    },
    {
      "id": 6,
      "comment": "hello",
      "userId": 1,
      "postedId": 1
    }
  ]
}